CREATE DATABASE Бібліотека CHAR SET UTF8;
USE Бібліотека;

CREATE TABLE книжка(
назва VARCHAR(120) NOT NULL,
опис VARCHAR(45) DEFAULT 'Опис відсутній',
дата_публікації VARCHAR(30) NOT NULL DEFAULT '2018-01-01' ,
автор VARCHAR(60) NOT NULL,
категорія VARCHAR(30) NOT NULL

);

INSERT INTO книжка(назва, опис, дата_публікації, автор, категорія)
VALUES
('Війна і мир', DEFAULT, DEFAULT, 'Толстой Лев Миколайович', 'романи, повісті, оповідання'),
('Вій', DEFAULT, DEFAULT, 'Гоголь', 'романи, повісті, оповідання'),
('ХТМЛ та СІСС', DEFAULT, DEFAULT, 'Пупкін Вася', 'романи, повісті, оповідання'),
('Джава', DEFAULT, DEFAULT, 'Мяч Сергій', 'романи, повісті, оповідання'),
('MySQL', DEFAULT, DEFAULT, 'Мотика Семен', 'романи, повісті, оповідання'),
('Мойдодир', DEFAULT, DEFAULT, 'Худий Лев', 'романи, повісті, оповідання'),
('Балади', DEFAULT, DEFAULT, 'Українка Леся', 'романи, повісті, оповідання'),
('Пісні', DEFAULT, DEFAULT, 'Олстой Лев Миколайович', 'романи, повісті, оповідання'),
('Басні', DEFAULT, DEFAULT, 'Неполстой Лев Миколайович', 'романи, повісті, оповідання'),
('Казочки', DEFAULT, DEFAULT, 'Пустой Лев Миколайович', 'романи, повісті, оповідання'),
('Мир', DEFAULT, DEFAULT, 'Стой Лев Миколайович', 'романи, повісті, оповідання');

SELECT * FROM книжка;





